app/controllers/api/amenities_controller.rb

  def index
    @amenities = Amenity.all
---
SELECT "amenities".* FROM "amenities"

  def show
    @amenityTime = Amenity.find params[:id]
---
SELECT  "amenities".* FROM "amenities" WHERE "amenities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]