_site/app/controllers/api/users_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 AND "bookings"."amenity_id" = $2  [["user_id", "1"], ["amenity_id", "1"]]
---
  def user_bookings
    @bookings = Booking.where(user_id: params[:id], amenity_id: params[:amenity_id])